app/views/carts/_cart.html.erb

  <div class="col-md-3">
    <%= link_to store_path(cart.items.first.menu.restaurant.name) do %>
---
SELECT "items".* FROM "items" WHERE "items"."cart_id" = ?  [["cart_id", 1]]
SELECT "restaurants".* FROM "restaurants" ORDER BY "restaurants".updated_at DESC LIMIT 1