app/controllers/restaurants_controller.rb

UPDATE "restaurants" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "restaurants"."id" = 1
---
  def update
    respond_to do |format|
      if @restaurant.update(restaurant_params)