app/controllers/store_controller.rb

  def index
    @restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants" ORDER BY "restaurants".updated_at DESC LIMIT 1